---
kind: method
id: M:Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Clear
source: html/63ea5941-4eac-e103-0222-e0a57ec7aeb5.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Clear Method

Removes every GroundConductorSize from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```